In [13]:
import pandas as pd

In [14]:
df=pd.read_excel(r"C:\clg\4 DPFE MEENAKSHI\OneDrive\Desktop\MOVIE.xlsx")

In [15]:
df.head()

   S.no         Name  rating
0      1        DDLJ  5 star
1      2         War  4 star
2      3      Pathan  3 star
3      4  Home Alone  3 star
4      5   Avengers   5 star

In [16]:
#returns me count of each category

In [17]:
df['rating'].value_counts()

3 star    3
5 star    2
4 star    2
2 star    1
Name: rating, dtype: int64

In [18]:
encode={'rating':{"1 star":1,
    "2 star":2,
    "3 star":3,
    "4 star":4,
    "5 star":5}
    
}

In [19]:
encoded_df=df.replace(encode)

In [20]:
encoded_df

   S.no         Name  rating
0      1        DDLJ       5
1      2         War       4
2      3      Pathan       3
3      4  Home Alone       3
4      5   Avengers        5
5      6  Spider Man       4
6      7       Tiger       3
7      8      ABCD 3       2

In [21]:
output=encoded_df.to_excel('data.xlsx')

In [22]:
pd.read_excel('data.xlsx')

   Unnamed: 0  S.no         Name  rating
0           0      1        DDLJ       5
1           1      2         War       4
2           2      3      Pathan       3
3           3      4  Home Alone       3
4           4      5   Avengers        5
5           5      6  Spider Man       4
6           6      7       Tiger       3
7           7      8      ABCD 3       2

In [23]:
df.head(3)

   S.no     Name  rating
0      1    DDLJ  5 star
1      2     War  4 star
2      3  Pathan  3 star

In [26]:
data=pd.read_excel(r"C:\Users\ARJUN\OneDrive\Desktop\MOVIE.xlsx")

In [27]:
data.head(7)

   S.no         Name  rating
0      1        DDLJ  5 star
1      2         War  4 star
2      3      Pathan  3 star
3      4  Home Alone  3 star
4      5   Avengers   5 star
5      6  Spider Man  4 star
6      7       Tiger  3 star

In [29]:
type(data['rating'])

pandas.core.series.Series

In [30]:
data.dtypes

S.no       int64
Name      object
rating    object
dtype: object

In [33]:
data['rating']=data['rating'].astype('category')

In [34]:
data.dtypes

S.no         int64
Name        object
rating    category
dtype: object

In [35]:
data['Rating_new']=data['rating'].cat.codes#encoding your categories
#convert my category values from 0 to n
"""
ratings-category
1star
2star-0
3star-1
4star-2
5star-3
"""

'\nratings-category\n1star\n2star-0\n3star-1\n4star-2\n5star-3\n'

In [36]:
data

   S.no         Name  rating  Rating_new
0      1        DDLJ  5 star           3
1      2         War  4 star           2
2      3      Pathan  3 star           1
3      4  Home Alone  3 star           1
4      5   Avengers   5 star           3
5      6  Spider Man  4 star           2
6      7       Tiger  3 star           1
7      8      ABCD 3  2 star           0

In [39]:
pd.get_dummies(data, columns=['rating']).head()
#dummy data- collide, misinterpretedfrom sk

,S.no,Name,Rating_new,rating_2 star,rating_3 star,rating_4 star,rating_5 star
0,1,DDLJ,3,0,0,0,1
1,2,War,2,0,0,1,0
2,3,Pathan,1,0,1,0,0
3,4,Home Alone,1,0,1,0,0
4,5,Avengers,3,0,0,0,1

In [40]:
from sklearn.preprocessing import OrdinalEncoder

In [41]:
obj=OrdinalEncoder()#creating object of encoder

In [43]:
data['encode']=obj.fit_transform(data[['rating']])

In [44]:
data.head(7)

   S.no         Name  rating  Rating_new  encode
0      1        DDLJ  5 star           3     3.0
1      2         War  4 star           2     2.0
2      3      Pathan  3 star           1     1.0
3      4  Home Alone  3 star           1     1.0
4      5   Avengers   5 star           3     3.0
5      6  Spider Man  4 star           2     2.0
6      7       Tiger  3 star           1     1.0

In [45]:
data.value_counts

<bound method DataFrame.value_counts of    S.no         Name  rating  Rating_new  encode
0      1        DDLJ  5 star           3     3.0
1      2         War  4 star           2     2.0
2      3      Pathan  3 star           1     1.0
3      4  Home Alone  3 star           1     1.0
4      5   Avengers   5 star           3     3.0
5      6  Spider Man  4 star           2     2.0
6      7       Tiger  3 star           1     1.0
7      8      ABCD 3  2 star           0     0.0>